Lr12/app/controllers/sessions_controller.rb

  def create
    user = User.find_by_name(params[:name])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Yury"], ["LIMIT", 1]]