Lr12/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at", "password_hash") VALUES (?, ?, ?, ?)  [["name", "Yury"], ["created_at", "2017-12-13 21:16:00.903331"], ["updated_at", "2017-12-13 21:16:00.903331"], ["password_hash", "$2a$10$7LEELqUoyb0q94QKz1F2Fe0JoAkh4/RxG5nLACAWQ.5eWziCFRi6S"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "password_hash" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_hash", "$2a$10$w.JbLEq5q4roE8iIcDU/Me4ukn34XvFvbouCC7RdW5fc4a9kB5h7O"], ["updated_at", "2017-12-13 21:17:24.019085"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)